{
    "languages": [
        {
            "languageName": "Python",
            "detail": "Developed by Guido van Rossum in the 1990s, the multi-purpose high-level Python has grown extremely fast over the years to become one of the most popular programming languages today.\n\nAnd the number one reason for Python’s popularity is its beginner-friendliness, which allows anyone, even individuals with no programming background, to pick up Python and start creating simple programs.\n\nBut that’s not all. It also offers an exceptionally vast collection of packages and libraries that can play a key role in reducing the ETA for your projects, along with a strong community of like-minded developers that is eager to help.",
            "usage": "Artificial Intelligence & Machine Learning",
            "tags": ["Web", "Desktop"],
            "id": 1
        },
        {
            "languageName": "Javascript",
            "detail": "JavaScript was one of the key programming languages alongside HTML and CSS that helped build the internet. JavaScript was created in 1995 by Netscape, the company that released the famous Netscape Navigator browser, to eliminate the crudeness of static web pages and add a pinch of dynamic behavior to them.Today, JavaScript has become a high-level multi-paradigm programming language that serves as the world’s top frontend programming language for the web, handling all the interactions offered by the webpages, such as pop-ups, alerts, events, and many more like them.",
            "usage": "Rich Interactive Web Development",
            "tags": ["Web", "Desktop", "Frontend Scripting"],
            "id": 2
        },
        {
            "languageName": "Java",
            "detail": "Created by Sun Microsystems’ James Gosling in 1995, the object-oriented programming language Java has been serving as a secure, reliable, and scalable tool for developers ever since.Some of the features offered by Java that make it more preferable than several other programming languages are its garbage collection capabilities, backward compatibility, platform independence via JVM, portability, and high performance.Java’s popularity can be seen clearly among the Fortune 500 members as 90% of them use Java to manage their business efficiently.",
            "usage": "Enterprise Application Development",
            "tags": ["Web", "Mobile", "Desktop"],
            "id": 3
        },
        {
            "languageName": "R",
            "detail": "If you do any sort of data analysis or work on Machine Learning projects, the chances are that you may have heard about R. The R programming language was first released to the public in 1993 by its creators Ross Ihaka and Robert Gentleman as an implementation of the S programming language with a special focus on statistical computing and graphical modeling.Over the years, R became one of the best programming languages for projects requiring extensive data analysis, graphical data modeling, spatial and time-series analysis.R also provides great extensibility via its functions and extensions that offer a ton of specialized techniques and capabilities to developers. The language also works remarkably well with code from other programming languages, such as C, C++, Python, Java, and .NET.",
            "usage": "Data Analysis",
            "tags": ["mainly desktop"],
            "id": 4
        },
        {
            "languageName": "C/C++",
            "detail": "Believe it or not, the programming languages C/C++ were all the rage in the very late 20th century. Why?It’s because C and C++ are both very low-level programming languages, offering blazing fast performance, which is why they were and are still being used to develop operating systems, file systems, and other system-level applications.While C was released in the 70s by Dennis Ritchie, C++, an extension to C with classes and many other additions, such as object-oriented features, was released later by Bjarne Stroustrup in the mid-80s. Even after close to 50 years, both the programming languages are still being used to create rock-steady and some of the fastest applications of all times.What this language is used for — As C & C++ both offer full access to the underlying hardware, they have been used to create a wide variety of applications and platforms, such as system applications, real-time systems, IoT, embedded systems, games, cloud, containers, and more.",
            "usage": "Operating Systems and System Tools",
            "tags": ["Mobile", "Desktop", "Embedded"],
            "id": 5
        },
        {
            "languageName": "Golang",
            "detail": "Go, or Golang, is a compiled programming language developed by the search giant Google. Created in 2009, Golang is an effort by the designers at Google to eliminate all the faults in the languages used throughout the organization and by keeping all the best features intact.Golang is fast and has a simple syntax, allowing anyone to pick up the programming language. It also comes with cross-platform support, making it easy and efficient to use.Go claims to offer a mix of high-performance like C/C++, simplicity, and usability like Python, along with efficient concurrency handling like Java.What this language is used for —  Go is primarily used in back-end technologies, cloud services, distributed networks, IoT, but it has also been used to create console utilities, GUI applications, and web applications.",
            "usage": "Server-Side Programming",
            "tags": ["cross plateform", "mainly desktop"],
            "id": 6
        },
        {
            "languageName": "C#",
            "detail": "C# was Microsoft’s approach to developing a programming language similar to the object-oriented C as part of its .NET initiative. The general-purpose multi-paradigm programming language was unveiled in 2000 by Anders Hejlsberg and has a syntax similar to C, C++, and Java. This was a huge plus point for developers who were familiar with either of these languages. It also offered relatively faster compilation and execution along with seamless scalability.C# was designed keeping in mind the .NET ecosystem, which allows developers to access a range of libraries and frameworks offered by Microsoft. And with the integration with Windows, C# becomes extremely easy to use, even perfect for developing Windows-based apps.What this language is used for — Developers can use C# for a range of projects, including game development, server-side programming, web development, creating web forms, mobile applications, and more. C# has also been used to develop apps for the Windows platform, specifically Windows 8 and 10.",
            "usage": "Application & Web Development Using .NET",
            "tags": [
                "cross plateform",
                "mobile and enterprise software applications"
            ],
            "id": 7
        },
        {
            "languageName": "PHP",
            "detail": "Just like Guido van Rossum’s Python, PHP also came to fruition as a side project by Rasmus Lerdorf, with the initial development dating back to the year 1994.Rasmus’s version of PHP was originally intended to help him maintain his personal homepage, but over the years, the project evolved to support web forms and databases.Today, PHP has become a general-purpose scripting language that’s being used around the globe, primarily for server-side web development. It is fast, simple, and is platform-independent, along with a large open-source software community.What this language is used for — A large number of companies are using PHP today to create tools like CMS (Content Management Systems), eCommerce platforms, and web applications. PHP also makes it extremely easy to create web pages in an instant.",
            "usage": " Web Development",
            "tags": [
                "cross plateform",
                "Desktop",
                "Mobile",
                "Web",
                "Backend Scripting"
            ],
            "id": 8
        },
        {
            "languageName": "SQL",
            "detail": "SQL, short for Structured Query Language, is probably one of the most crucial programming languages on this list.Designed by Donald D. Chamberlin and Raymond F. Boyce in 1974, the special-purpose programming language has played a key role in enabling developers to create and manage tables and databases for storing relational data over hundreds of thousands of data fields.Without SQL, organizations would have to rely on older and possibly slower methods of storing and accessing vast amounts of data. With SQL, much of these tasks can be done within seconds.Over the years, SQL has helped spawn a large number of RDBMS (Relational Database Management Systems) that offer much more than just the creation of tables and databases.What this language is used for — Pretty much every other project or industry that needs to deal with large amounts of data stored in tables or databases uses SQL through an RDBMS.",
            "usage": "Data Management   ",
            "tags": ["Backend", "Data Management"],
            "id": 9
        },
        {
            "languageName": "Swift",
            "detail": "Apple’s full control over its hardware and software has allowed it to deliver smooth and consistent experiences across its range of devices. And that’s where Swift comes in.Swift is Apple’s own programming language that was released in 2014 as a replacement for its Objective-C programming language. It is a multi-paradigm general-purpose programming language that’s extremely efficient and designed to improve developer productivity.Swift is a modern programming language (newest on this list), fast, powerful, and offers full interoperability with Objective-C. Over the years, Swift received numerous updates that helped it gain significant popularity among Apple’s iOS, macOS, watchOS, and tvOS platforms.What this language is used for — Paired with Apple’s Cocoa and Cocoa Touch framework, Swift can be used to create apps for virtually every Apple device, such as iPhones, iPads, Mac, Watch, and other devices.",
            "usage": "For Mobile App Development on iOS",
            "tags": ["Mobile", "IOS App Specially"],
            "id": 10
        }
    ]
}
